RESULTS_VM/redis_bare_20251115-1735.txt
=== 2025-11-15 17:35:56 — workload=redis env=bare run=4/7 ===
$ memtier_benchmark -s 192.168.1.60 -p 6379 --ratio=1:10 -t 4 -c 50 -d 64 -n 500000
4         Threads
50        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1746.25          ---          ---       225.31300        10.87900        21.50300        66.04700       189.10 
Gets        17462.34        80.91     17381.43       223.61039        10.87900        21.50300        66.55900       685.44 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      19208.59        80.91     17381.43       223.76517        10.87900        21.50300        66.55900       874.53 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.583        0.000
SET       9.279        5.000
SET       9.983       10.000
SET      10.367       15.000
SET      10.495       20.000
SET      10.623       25.000
SET      10.687       30.000
SET      10.751       35.000
SET      10.815       40.000
SET      10.815       45.000
SET      10.879       50.000
SET      10.943       52.500
SET      10.943       55.000
SET      10.943       57.500
SET      11.007       60.000
SET      11.007       62.500
SET      11.071       65.000
SET      11.071       67.500
SET      11.135       70.000
SET      11.135       72.500
SET      11.199       75.000
SET      11.263       76.250
SET      11.327       77.500
SET      11.391       78.750
SET      11.455       80.000
SET      11.711       81.250
SET      12.031       82.500
SET      12.351       83.750
SET      12.543       85.000
SET      12.799       86.250
SET      13.311       87.500
SET      13.567       88.125
SET      13.759       88.750
SET      13.887       89.375
SET      14.015       90.000
SET      14.079       90.625
SET      14.207       91.250
SET      14.271       91.875
SET      14.335       92.500
SET      14.399       93.125
SET      14.527       93.750
SET      14.591       94.062
SET      14.591       94.375
SET      14.655       94.688
SET      14.719       95.000
SET      14.783       95.312
SET      14.847       95.625
SET      14.911       95.938
SET      15.039       96.250
SET      15.167       96.562
SET      15.487       96.875
SET      15.807       97.031
SET      16.191       97.188
SET      16.511       97.344
SET      16.895       97.500
SET      17.279       97.656
SET      17.791       97.812
SET      18.431       97.969
SET      19.327       98.125
SET      20.095       98.281
SET      20.607       98.438
SET      20.735       98.516
SET      20.863       98.594
SET      20.991       98.672
SET      21.119       98.750
SET      21.247       98.828
SET      21.375       98.906
SET      21.503       98.984
SET      21.759       99.062
SET      22.271       99.141
SET      23.295       99.219
SET      23.935       99.258
SET      24.447       99.297
SET      24.959       99.336
SET      25.855       99.375
SET      26.879       99.414
SET      27.775       99.453
SET      28.927       99.492
SET      30.591       99.531
SET      32.383       99.570
SET      34.559       99.609
SET      35.583       99.629
SET      36.607       99.648
SET      38.143       99.668
SET      39.423       99.688
SET      40.959       99.707
SET      42.239       99.727
SET      44.031       99.746
SET      46.079       99.766
SET      48.127       99.785
SET      50.431       99.805
SET      51.455       99.814
SET      52.735       99.824
SET      54.015       99.834
SET      55.295       99.844
SET      56.831       99.854
SET      58.623       99.863
SET      60.671       99.873
SET      62.719       99.883
SET      64.511       99.893
SET      66.559       99.902
SET      67.583       99.907
SET      69.119       99.912
SET      70.143       99.917
SET      71.679       99.922
SET      73.727       99.927
SET      75.775       99.932
SET      77.823       99.937
SET      80.383       99.941
SET      82.943       99.946
SET      85.503       99.951
SET      87.039       99.954
SET      89.087       99.956
SET      91.647       99.958
SET      95.231       99.961
SET     137.215       99.963
SET    603979.750       99.966
SET    603979.750      100.000
---
GET       0.503        0.000
GET       9.279        5.000
GET       9.983       10.000
GET      10.367       15.000
GET      10.495       20.000
GET      10.623       25.000
GET      10.687       30.000
GET      10.751       35.000
GET      10.815       40.000
GET      10.815       45.000
GET      10.879       50.000
GET      10.943       52.500
GET      10.943       55.000
GET      10.943       57.500
GET      11.007       60.000
GET      11.007       62.500
GET      11.071       65.000
GET      11.071       67.500
GET      11.135       70.000
GET      11.135       72.500
GET      11.199       75.000
GET      11.263       76.250
GET      11.327       77.500
GET      11.391       78.750
GET      11.455       80.000
GET      11.711       81.250
GET      12.031       82.500
GET      12.287       83.750
GET      12.543       85.000
GET      12.799       86.250
GET      13.311       87.500
GET      13.567       88.125
GET      13.759       88.750
GET      13.887       89.375
GET      14.015       90.000
GET      14.079       90.625
GET      14.143       91.250
GET      14.271       91.875
GET      14.335       92.500
GET      14.399       93.125
GET      14.527       93.750
GET      14.527       94.062
GET      14.591       94.375
GET      14.655       94.688
GET      14.719       95.000
GET      14.783       95.312
GET      14.847       95.625
GET      14.911       95.938
GET      15.039       96.250
GET      15.167       96.562
GET      15.487       96.875
GET      15.807       97.031
GET      16.127       97.188
GET      16.511       97.344
GET      16.895       97.500
GET      17.279       97.656
GET      17.791       97.812
GET      18.431       97.969
GET      19.327       98.125
GET      20.095       98.281
GET      20.607       98.438
GET      20.735       98.516
GET      20.863       98.594
GET      20.991       98.672
GET      21.119       98.750
GET      21.247       98.828
GET      21.375       98.906
GET      21.503       98.984
GET      21.759       99.062
GET      22.143       99.141
GET      23.295       99.219
GET      23.935       99.258
GET      24.447       99.297
GET      24.959       99.336
GET      25.727       99.375
GET      26.751       99.414
GET      27.775       99.453
GET      28.799       99.492
GET      30.463       99.531
GET      32.383       99.570
GET      34.559       99.609
GET      35.583       99.629
GET      36.863       99.648
GET      38.143       99.668
GET      39.423       99.688
GET      40.959       99.707
GET      42.495       99.727
GET      44.287       99.746
GET      46.079       99.766
GET      48.127       99.785
GET      50.431       99.805
GET      51.455       99.814
GET      52.735       99.824
GET      54.015       99.834
GET      55.551       99.844
GET      57.087       99.854
GET      58.879       99.863
GET      60.671       99.873
GET      62.719       99.883
GET      64.511       99.893
GET      67.071       99.902
GET      68.095       99.907
GET      69.119       99.912
GET      70.655       99.917
GET      72.191       99.922
GET      73.727       99.927
GET      76.287       99.932
GET      78.335       99.937
GET      80.895       99.941
GET      83.455       99.946
GET      86.015       99.951
GET      87.551       99.954
GET      89.599       99.956
GET      91.647       99.958
GET      95.231       99.961
GET     135.167       99.963
GET    603979.750       99.966
GET    603979.750      100.000
---
WAIT      0.000      100.000
=== end ===